package com.fh.utils.getdate;

public class MyData {


    // 假期
    public static String[] holiday1 = {
            "2018-01-01", // 元旦
            "2018-02-15", // 春节
            "2018-02-16", // 春节
            "2018-02-17", // 春节
            "2018-02-18", // 春节
            "2018-02-19", // 春节
            "2018-02-20", // 春节
            "2018-02-21", // 春节
            "2018-04-05", // 清明节
            "2018-04-06", // 清明节
            "2018-04-07", // 清明节
            "2018-04-29", // 劳动节
            "2018-04-30", // 劳动节
            "2018-05-01", // 劳动节
            "2018-06-16", // 端午节
            "2018-06-17", // 端午节
            "2018-06-18", // 端午节
            "2018-09-22", // 中秋节
            "2018-09-23", // 中秋节
            "2018-09-24", // 中秋节
            "2018-10-01", // 国庆节
            "2018-10-02", // 国庆节
            "2018-10-03", // 国庆节
            "2018-10-04", // 国庆节
            "2018-10-05", // 国庆节
            "2018-10-06", // 国庆节
            "2018-10-07", // 国庆节
            "2018-12-31", // 元旦
            "2019-01-01" // 元旦
    };

    // 调休
    public static String[] holiday2 = {
            "2018-02-11", // 春节_调休
            "2018-02-24", // 春节_调休
            "2018-04-08", // 清明_节调休
            "2018-04-28", // 劳动_节调休
            "2018-09-29", // 国庆节_调休
            "2018-09-30", // 国庆节_调休
            "2018-12-29"  // 元旦_调休
    };

    // 作息时间1
    public static String[] workTime1 = {
            "08:30", // 上午上班时间
            "12:00", // 上午下班时间
            "13:00", // 下午上班时间
            "17:30"  // 下午下班时间
    };

    // 作息时间2
    public static String[] workTime2 = {
            "09:00", // 上午上班时间
            "12:00", // 上午下班时间
            "13:00", // 下午上班时间
            "18:00"  // 下午下班时间
    };

}
